mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
private:
  void clear();
  std::vector<QueueItem> _queueCollection = std::vector<QueueItem>();
  uint8_t _maxQueue = 10;
};

class FirebaseESP8266
{
public:
  friend class StreamData;
  friend class FirebaseData;
  friend class FCMObject;
  friend class QueryFilter;
  friend class MultiPathStreamData;

  typedef void (*StreamEventCallback)(StreamData);
  typedef void (*MultiPathStreamEventCallback)(MultiPathStreamData);

  typedef void (*StreamTimeoutCallback)(bool);
  typedef void (*QueueInfoCallback)(QueueInfo);

  FirebaseESP8266();
  ~FirebaseESP8266();

  /*
    Store Firebase's authentication credentials.

    @param host - Your Firebase database project host e.g. Your_ProjectID.firebaseio.com.
    @param auth - Your database secret.
    @param caCert - Root CA certificate base64 string (PEM file).
    @param caCertFile - Root CA certificate DER file (binary).
    @param StorageType - Type of storage, StorageType::SD and StorageType::FLASH.
    @param GMTOffset - GMT time offset in hour is required to set time in order to make BearSSL 
                       data decryption/encryption to work.
                       This parameter is only required for ESP8266 Core SDK v2.5.x or later.

    Root CA certificate DER file is only supported in Core SDK v2.5.x

  */
  void begin(const String &host, const String &auth);

  void begin(const String &host, const String &auth, const char *caCert, float GMTOffset = 0.0);

  void begin(const String &host, const String &auth, const String &caCertFile, uint8_t storageType, float GMTOffset = 0.0);

  /*
    Stop Firebase and release all resources.
    
    @param fbdo - Firebase Data Object to hold data and instances.

  */
  void end(FirebaseData &fbdo);

  /*
    Reconnect WiFi if lost connection.

    @param reconnect - The boolean to set/unset WiFi AP reconnection.

  */
  void reconnectWiFi(bool reconnect);

  /*
    Set the decimal places for float value to be stored in database.

    @param digits - The decimal places. 

  */
  void setFloatDigits(uint8_t digits);

  /*
    Set the decimal places for double value to be stored in database.

    @param digits - The decimal places. 

  */
  void setDoubleDigits(uint8_t digits);

  /*
    Set the timeout of Firebase.get functions.

    @param fbdo - Firebase Data Object to hold data and instances.

    @param millisec - The milliseconds to limit the request (0 - 900,000 ms or 15 min).

  */
  void setReadTimeout(FirebaseData &fbdo, int millisec);

  /*
    Set the size limit of payload data that will write to the database for each request.

    @param fbdo - Firebase Data Object to hold data and instances.

    @param size - The size identified string e.g. tiny, small, medium, large and unlimited.

    Size string and its write timeout in seconds e.g. tiny (1s), small (10s), medium (30s) and large (60s).

  */
  void setwriteSizeLimit(FirebaseData &fbdo, const String &size);

  /*
    Read the database rules.

    @param fbdo - Firebase Data Object to hold data and instances.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].jsonData will return the JSON string value of
    database rules returned from the server.

  */
  bool getRules(FirebaseData &fbdo);

  /*
    Write the database rules.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param rules - Database rules in JSON String format.

    @return - Boolean type status indicates the success of the operation.

  */
  bool setRules(FirebaseData &fbdo, const String &rules);

  /*
    Determine whether the defined database path exists or not.
    
    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Database path to be checked.

    @return - Boolean type result indicates whether the defined path existed or not.

   */
  bool pathExist(FirebaseData &fbdo, const String &path);

  /*
    Determine the unique identifier (ETag) of current data at the defined database path.

    @return String of unique identifier.

  */
  String getETag(FirebaseData &fbdo, const String &path);

  /*
    Get the shallowed data at a defined node path.

    @param fbdo - Firebase Data Object to hold data and instances.

    @param path - Database path being read the data.

    @return - Boolean type status indicates the success of the operation.

    Return the child data with its value or JSON object (its values will be truncated to true).

    Call [FirebaseData object].stringData() to get shallowed string data (number, string and JSON object).

  */
  bool getShallowData(FirebaseData &fbdo, const String &path);

  /*
    Enable the library to use only classic HTTP GET and POST methods.

    @param fbdo - Firebase Data Object to hold data and instances.

    @param flag - Boolean value to enable.

    This option used to escape the Firewall restriction (if the device is connected through Firewall) that allows only HTTP GET and POST
    
    HTTP PATCH request was sent as PATCH which not affected by this option.

  */
  void enableClassicRequest(FirebaseData &fbdo, bool flag);

  /*
    Set the virtual child node ".priority" to the defined database path. 
    
    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which to set the priority value.
    @param priority - The priority value.
    
    @return - Boolean type status indicates the success of the operation.

    This allows us to set priority to any node other than a priority that set through setJSON, pushJSON, updateNode, and updateNodeSilent functions.
    
    The returned priority value from server can read from function [FirebaseData object].priority().

   */
  bool setPriority(FirebaseData &fbdo, const String &path, float priority);

  /*
    Read the virtual child node ".priority" value at the defined database path. 
    
    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which to set the priority value.
    
    @return - Boolean type status indicates the success of the operation.

    The priority value from server can read from function [FirebaseData object].priority().

   */
  bool getPriority(FirebaseData &fbdo, const String &path);

