mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*
    Append new integer value to the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which integer value will be appended.
    @param intValue - The appended value.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushInt(FirebaseData &fbdo, const String &path, int intValue);

  bool push(FirebaseData &fbdo, const String &path, int intValue);

  /*

    Append new integer value and the virtual child ".priority" to the defined database path.

  */
  bool pushInt(FirebaseData &fbdo, const String &path, int intValue, float priority);

  bool push(FirebaseData &fbdo, const String &path, int intValue, float priority);

  /*
    Append new float value to the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path in which float value will be appended.
    @param floatValue - The appended value.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushFloat(FirebaseData &fbdo, const String &path, float floatValue);

  bool push(FirebaseData &fbdo, const String &path, float floatValue);

  /*

    Append new float value and the virtual child ".priority" to the defined database path.

  */
  bool pushFloat(FirebaseData &fbdo, const String &path, float floatValue, float priority);

  bool push(FirebaseData &fbdo, const String &path, float floatValue, float priority);

  /*
    Append new double value (8 bytes) to the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path in which float value will be appended.
    @param doubleValue - The appended value.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushDouble(FirebaseData &fbdo, const String &path, double doubleValue);

  bool push(FirebaseData &fbdo, const String &path, double doubleValue);

  /*

    Append new double value (8 bytes) and the virtual child ".priority" to the defined database path.

  */
  bool pushDouble(FirebaseData &fbdo, const String &path, double doubleValue, float priority);

  bool push(FirebaseData &fbdo, const String &path, double doubleValue, float priority);

  /*
    Append new Boolean value to the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which Boolean value will be appended.
    @param boolValue - The appended value.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushBool(FirebaseData &fbdo, const String &path, bool boolValue);

  bool push(FirebaseData &fbdo, const String &path, bool boolValue);

  /*

    Append the new Boolean value and the virtual child ".priority" to the defined database path.

  */
  bool pushBool(FirebaseData &fbdo, const String &path, bool boolValue, float priority);

  bool push(FirebaseData &fbdo, const String &path, bool boolValue, float priority);

  /*
    Append a new string (text) to the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which string will be appended.
    @param StringValue - The appended value.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key stored in Firebase Data object,
    which can be accessed via function [FirebaseData object].pushName().

  */
  bool pushString(FirebaseData &fbdo, const String &path, const String &stringValue);

  bool push(FirebaseData &fbdo, const String &path, const char *stringValue);

  bool push(FirebaseData &fbdo, const String &path, const String &stringValue);

  bool push(FirebaseData &fbdo, const String &path, const StringSumHelper &stringValue);

  /*

    Append new string (text) and the virtual child ".priority" to the defined database path.

  */
  bool pushString(FirebaseData &fbdo, const String &path, const String &stringValue, float priority);

  bool push(FirebaseData &fbdo, const String &path, const char *stringValue, float priority);

  bool push(FirebaseData &fbdo, const String &path, const String &stringValue, float priority);

  bool push(FirebaseData &fbdo, const String &path, const StringSumHelper &stringValue, float priority);

  /*
    Append new child nodes key and value (using FirebaseJson object) to the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJson object will be appended.
    @param json - The appended FirebaseJson object.

    @return - Boolean type status indicates the success of the operation.

    The new appended node key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushJSON(FirebaseData &fbdo, const String &path, FirebaseJson &json);

  bool push(FirebaseData &fbdo, const String &path, FirebaseJson &json);

  /*

    Append new child node key and value (FirebaseJson object) and the virtual child ".priority" to the defined database path.

  */

  bool pushJSON(FirebaseData &fbdo, const String &path, FirebaseJson &json, float priority);

  bool push(FirebaseData &fbdo, const String &path, FirebaseJson &json, float priority);

