mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*

    Append child node array (using FirebaseJsonArray object) to the defined database path.

    This will replace any child nodes inside the defined path with array defined in FirebaseJsonArray object.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJsonArray object will be appended.
    @param arr - The appended FirebaseJsonArray object.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushArray(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr);

  bool push(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr);

  /*

    Append FirebaseJsonArray object and virtual child ".priority" at the defined database path.

  */

  bool pushArray(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr, float priority);

  bool push(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr, float priority);

  /*
    Append new blob (binary data) to the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which binary data will be appended.
    @param blob - Byte array of data.
    @param size - Size of the byte array.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushBlob(FirebaseData &fbdo, const String &path, uint8_t *blob, size_t size);

  bool push(FirebaseData &fbdo, const String &path, uint8_t *blob, size_t size);

  /*

    Append new blob (binary data) and the virtual child ".priority" to the defined database path.

  */
  bool pushBlob(FirebaseData &fbdo, const String &path, uint8_t *blob, size_t size, float priority);

  bool push(FirebaseData &fbdo, const String &path, uint8_t *blob, size_t size, float priority);

  /*
    Append new binary data from the file stores on SD card/Flash memory to the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param storageType - Type of storage to read file data, StorageType::SPIFS or StorageType::SD.
    @param path - Target database path in which binary data from the file will be appended.
    @param fileName - File name included its path in SD card/Flash memory.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushFile(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName);

  bool push(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName);

  /*

    Append new binary data from the file stores on SD card/Flash memory and the virtual child ".priority" to the defined database path.

  */
  bool pushFile(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName, float priority);

  bool push(FirebaseData &fbdo, uint8_t storageType, const String &path, const String &fileName, float priority);

  /*
    Append the new Firebase server's timestamp to the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which timestamp will be appended.

    @return - Boolean type status indicates the success of the operation.
    
    The new appended node's key will be stored in Firebase Data object, 
    which its value can be accessed via function [FirebaseData object].pushName().

   */
  bool pushTimestamp(FirebaseData &fbdo, const String &path);

  /*
    Set integer data at the defined database path.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which integer data will be set.
    @param intValue - Integer value to set.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully stores in the database.

    Call [FirebaseData object].intData will return the integer value of
    payload returned from server.

  */
  bool setInt(FirebaseData &fbdo, const String &path, int intValue);

  bool set(FirebaseData &fbdo, const String &path, int intValue);

  /*

    Set integer data and virtual child ".priority" at the defined database path.

  */
  bool setInt(FirebaseData &fbdo, const String &path, int intValue, float priority);

  bool set(FirebaseData &fbdo, const String &path, int intValue, float priority);

  /*
    Set integer data at the defined database path if defined database path's ETag matched the ETag value.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which integer data will be set.
    @param intValue - Integer value to set.
    @param ETag - Known unique identifier string (ETag) of defined database path.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database. 
    
    If ETag at the defined database path does not match the provided ETag parameter,
    the operation will fail with HTTP code 412, Precondition Failed (ETag is not matched).

    If the operation failed due to ETag is not match, call [FirebaseData object].ETag() to get the current ETag value.
    Also call [FirebaseData object].intData to get the current integer value.
    

   */
  bool setInt(FirebaseData &fbdo, const String &path, int intValue, const String &ETag);

  bool set(FirebaseData &fbdo, const String &path, int intValue, const String &ETag);

