mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*

    Set JSON data or FirebaseJson object and virtual child ".priority" at the defined database path.

  */

  bool setJSON(FirebaseData &fbdo, const String &path, FirebaseJson &json, float priority);

  bool set(FirebaseData &fbdo, const String &path, FirebaseJson &json, float priority);

  /*

    Set child node key and value (using JSON data or FirebaseJson object) to the defined database path if defined database path's ETag matched the ETag value.

    This will replace any child nodes inside the defined path with node' s key
    and value defined in JSON data or FirebaseJson object.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in JSON data will be replaced or set.
    @param json - The FirebaseJson object.
    @param ETag - Known unique identifier string (ETag) of defined database path.

    @return - Boolean type status indicates the success of the operation.
    
    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database. 
    
    Call [FirebaseData object].jsonData will return the JSON string value of
    payload returned from server.

    If ETag at the defined database path does not match the provided ETag parameter,
    the operation will fail with HTTP code 412, Precondition Failed (ETag is not matched).

    If the operation failed due to ETag is not match, call [FirebaseData object].ETag() to get the current ETag value.
    Also call [FirebaseData object].jsonData to get the current JSON string value.

   */

  bool setJSON(FirebaseData &fbdo, const String &path, FirebaseJson &json, const String &ETag);

  bool set(FirebaseData &fbdo, const String &path, FirebaseJson &json, const String &ETag);

  /*

    Set JSON data or FirebaseJson object and the virtual child ".priority" if defined ETag matches at the defined database path 

  */

  bool setJSON(FirebaseData &fbdo, const String &path, FirebaseJson &json, float priority, const String &ETag);

  bool set(FirebaseData &fbdo, const String &path, FirebaseJson &json, float priority, const String &ETag);

  /*

    Set child node array (using FirebaseJsonArray object) to the defined database path.

    This will replace any child nodes inside the defined path with array defined in FirebaseJsonArray object.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJsonArray object will be replaced or set.
    @param arr - The FirebaseJsonArray object.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in the database.

    Call [FirebaseData object].jsonArray will return pointer to FirebaseJsonArray object contains array
    payload returned from server, get the array payload using FirebaseJsonArray *arr = firebaseData.jsonArray();

  */
  bool setArray(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr);

  bool set(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr);

  /*

    Set FirebaseJsonArray object and virtual child ".priority" at the defined database path.

  */

  bool setArray(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr, float priority);

  bool set(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr, float priority);

  /*

    Set array (using JSON data or FirebaseJson object) to the defined database path if defined database path's ETag matched the ETag value.

    This will replace any child nodes inside the defined path with array defined in FirebaseJsonArray object.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in JSON data will be replaced or set.
    @param arr - The FirebaseJsonArray object.
    @param ETag - Known unique identifier string (ETag) of defined database path.

    @return - Boolean type status indicates the success of the operation.
    
    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database.

    Call [FirebaseData object].jsonArray will return pointer to FirebaseJsonArray object contains array
    payload returned from server, get the array payload using FirebaseJsonArray *arr = firebaseData.jsonArray();

    If ETag at the defined database path does not match the provided ETag parameter,
    the operation will fail with HTTP code 412, Precondition Failed (ETag is not matched).

    If the operation failed due to ETag is not match, call [FirebaseData object].ETag() to get the current ETag value.
    Also call [FirebaseData object].jsonArray to get the pointer to FirebaseJsonArray object of current array value.

   */

  bool setArray(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr, const String &ETag);

  bool set(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr, const String &ETag);

  /*

    Set FirebaseJsonArray object and the virtual child ".priority" if defined ETag matches at the defined database path 

  */

  bool setArray(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr, float priority, const String &ETag);

  bool set(FirebaseData &fbdo, const String &path, FirebaseJsonArray &arr, float priority, const String &ETag);

  /*
    Set blob (binary data) at the defined database path.

    This will replace any child nodes inside the defined path with a blob or binary data.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param path - Target database path which binary data will be set.
    @param blob - Byte array of data.
    @param size - Size of the byte array.

    @return - Boolean type status indicates the success of the operation.

    No payload returned from the server.

  */
  bool setBlob(FirebaseData &fbdo, const String &path, uint8_t *blob, size_t size);

  bool set(FirebaseData &fbdo, const String &path, uint8_t *blob, size_t size);

