mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*
   
   Set the maximum Firebase Error Queues in the collection (0 - 255).

   Firebase read/store operation causes by network problems and buffer overflow will be added to Firebase Error Queues collection.

   @param fbdo - Firebase Data Object to hold data and instances.
   @param num - The maximum Firebase Error Queues.

  */
  void setMaxErrorQueue(FirebaseData &fbdo, uint8_t num);

  /*
   
   Save Firebase Error Queues as SPIFFS file (save only database store queues).

   Firebase read (get) operation will not be saved.

   @param fbdo - Firebase Data Object to hold data and instances.
   @param filename - Filename to be saved.
   @param storageType - Type of storage to save file, StorageType::SPIFS or StorageType::SD.
    
  */
  bool saveErrorQueue(FirebaseData &fbdo, const String &filename, uint8_t storageType);

  /*
   
   Delete file in Flash (SPIFFS) or SD card.

   @param filename - File name to delete.
   @param storageType - Type of storage to save file, StorageType::SPIFS or StorageType::SD.
    
  */
  bool deleteStorageFile(const String &filename, uint8_t storageType);

  /*
   
   Restore Firebase Error Queues from the SPIFFS file.

   @param fbdo - Firebase Data Object to hold data and instances.
   @param filename - Filename to be read and restore queues.
   @param storageType - Type of storage to read file, StorageType::SPIFS or StorageType::SD.
    
  */
  bool restoreErrorQueue(FirebaseData &fbdo, const String &filename, uint8_t storageType);

  /*
    Determine the number of Firebase Error Queues stored in a defined SPIFFS file.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param filename - Filename to be read and count for queues.
    @param storageType - Type of storage to read file, StorageType::SPIFS or StorageType::SD.

    @return Number (0-255) of queues store in defined SPIFFS file.

  */
  uint8_t errorQueueCount(FirebaseData &fbdo, const String &filename, uint8_t storageType);

  /*
    Determine number of queues in Firebase Data object Firebase Error Queues collection.

    @param fbdo - Firebase Data Object to hold data and instances.
    @return Number (0-255) of queues in Firebase Data object queue collection.

  */
  uint8_t errorQueueCount(FirebaseData &fbdo);

  /*
    Determine whether the  Firebase Error Queues collection was full or not.

    @param fbdo - Firebase Data Object to hold data and instances.

    @return Boolean type status indicates whether the  Firebase Error Queues collection was full or not.

  */
  bool isErrorQueueFull(FirebaseData &fbdo);

  /*
    Process all failed Firebase operation queue items when the network is available.

    @param fbdo - Firebase Data Object to hold data and instances.

    @param callback - a Callback function that accepts QueueInfo parameter.
  
  */
  void processErrorQueue(FirebaseData &fbdo, QueueInfoCallback callback = NULL);

  /*
    Return Firebase Error Queue ID of last Firebase Error.

    Return 0 if there is no Firebase Error from the last operation.

    @param fbdo - Firebase Data Object to hold data and instances.
    
    @return Number of Queue ID.

   */
  uint32_t getErrorQueueID(FirebaseData &fbdo);

  /*
    Determine whether the Firebase Error Queue currently exists is Error Queue collection or not.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param errorQueueID - The Firebase Error Queue ID get from getErrorQueueID.
    
   @return - Boolean type status indicates the queue existence.

   */
  bool isErrorQueueExisted(FirebaseData &fbdo, uint32_t errorQueueID);

  /*
    Start the Firebase Error Queues Auto Run Process.

    @param fbdo - Firebase Data Object to hold data and instances.
    @param callback - a Callback function that accepts QueueInfo Object as a parameter, optional.

    The following functions are available from QueueInfo Object accepted by callback.

    queueInfo.totalQueues(), get the total Error Queues in Error Queue Collection.

    queueInfo.currentQueueID(), get current Error Queue ID that being process.

    queueInfo.isQueueFull(), determine whether Error Queue Collection is full or not.

    queueInfo.dataType(), get a string of the Firebase call data type that being process of current Error Queue.

    queueInfo.method(), get a string of the Firebase call method that being process of current Error Queue.

    queueInfo.path(), get a string of the Firebase call path that being process of current Error Queue.

   */
  void beginAutoRunErrorQueue(FirebaseData &fbdo, QueueInfoCallback callback = NULL);

  /*
    Stop the Firebase Error Queues Auto Run Process.

    @param fbdo - Firebase Data Object to hold data and instances.

  */
  void endAutoRunErrorQueue(FirebaseData &fbdo);

  /*
    Clear all Firbase Error Queues in Error Queue collection.

    @param fbdo - Firebase Data Object to hold data and instances.

  */
  void clearErrorQueue(FirebaseData &fbdo);

  /*
    Send Firebase Cloud Messaging to the device with the first registration token which added by firebaseData.fcm.addDeviceToken.

    @param fbdo - Firebase Data Object to hold data and instances.

    @param index - The index (starts from 0) of recipient device token which added by firebaseData.fcm.addDeviceToken
    
    @return - Boolean type status indicates the success of the operation.

   */
  bool sendMessage(FirebaseData &fbdo, uint16_t index);

  /*
    Send Firebase Cloud Messaging to all devices (multicast) which added by firebaseData.fcm.addDeviceToken.

    @param fbdo - Firebase Data Object to hold data and instances.
    
    @return - Boolean type status indicates the success of the operation.

   */
  bool broadcastMessage(FirebaseData &fbdo);

  /*
    Send Firebase Cloud Messaging to devices that subscribed to the topic.

    @param fbdo - Firebase Data Object to hold data and instances.
    
    @return - Boolean type status indicates the success of the operation.

   */
  bool sendTopic(FirebaseData &fbdo);

